# Analyzing CIA Factbook Data Using SQL

## Introduction:
In this project, we'll work with data from the [CIA World Factbook](https://www.cia.gov/the-world-factbook/) a compendium of statistics about all of the countries on Earth. We'll try to answer the following questions using the factbook:

* Which countries are densely populated?
* Which countries will add the most people to their populations next year?
* Which countries have the largest area? Of those, how much of it land, and how much of it is water?

This is my first project using SQL, we'll use Jupyter Notebook to analyze data from this database. You can download the database [here](https://dsserver-prod-resources-1.s3.amazonaws.com/257/factbook.db). 
We'll use the following code to connect our Jupyter Notebook to our database file:

In [12]:
import sqlite3
import sqlalchemy
sqlalchemy.create_engine("sqlite:///factbook.db")
%reload_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

### Overview of Data
To find out the table where we will be working from, we'll query the database to get this information directly.

In [14]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

Now that we know that the name of our table is <b>facts</b> let's explore a bit.

In [2]:
%%sql
SELECT *
  FROM facts
 LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

Here are the descriptions for some of the columns:

* `name` — the name of the country.
* `area` — the country's total area (both land and water).
* `area_land` — the country's land area in square kilometers.
* `area_water` — the country's waterarea in square kilometers.
* `population` — the country's population.
* `population_growth` — the country's population growth as a percentage.
* `birth_rate` — the country's birth rate, or the number of births per year per 1,000 people.
* `death_rate` — the country's death rate, or the number of death per year per 1,000 people.

Let's start by calculating some summary statistics and look for any outlier countries.

In [3]:
%%sql
SELECT MIN(population) as min_pop, 
       MAX(population) as max_pop, 
       MIN(population_growth) as min_pop_grwth, 
       MAX(population_growth) as max_pop_grwth
  FROM facts

Done.

[(0, 7256490011, 0.0, 4.02)]

### Exploring Outliers:

We see a few interesting things in the summary statistics on the previous table:

* There's a country with a population of <b>0</b>
* There's a country with a population of <b>7256490011</b> (or more than 7.2 billion people)

Let's use subqueries to zoom in on just these countries <i>without</i> using the specific values.

We'll:

1. Write a query that returns the countries with the minimum population.
2. Write a query that returns the countries with the maximum population.

In [4]:
%%sql
SELECT *
  FROM facts
WHERE population == (SELECT MIN(population)
                          FROM facts)

Done.

[(250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None)]

In [5]:
%%sql
SELECT *
  FROM facts
WHERE population == (SELECT MAX(population)
                          FROM facts)

Done.

[(261, 'xx', 'World', None, None, None, 7256490011, 1.08, 18.6, 7.8, None)]

In [6]:
%%sql
SELECT name, population AS 'population ascending'
  FROM facts
 GROUP BY population
 ORDER BY 'population ascending' ASC
 LIMIT 5;

Done.

[('Southern Ocean', None),
 ('Antarctica', 0),
 ('Pitcairn Islands', 48),
 ('Cocos (Keeling) Islands', 596),
 ('Holy See (Vatican City)', 842)]

In [11]:
%%sql
SELECT name, population AS 'population descending'
  FROM facts
GROUP BY population
ORDER BY population DESC 
LIMIT 5;

Done.

[('World', 7256490011),
 ('China', 1367485388),
 ('India', 1251695584),
 ('European Union', 513949445),
 ('United States', 321368864)]

## Exploring Average Population and Area:
It seems like the table contains a row for the whole world, which explains the population of over 7.2 billion. It also seems like the table contains a row for Antarctica, which explains the population of 0. This seems to match the CIA Factbook page for [Antarctica](https://www.cia.gov/library/publications/the-world-factbook/geos/ay.html).
<p><img src="https://s3.amazonaws.com/dq-content/257/fb_antarctica.png"></p>

Let's calculate the summary statistics again, this time excluding the entire row: `World`.

In [8]:
%%sql
SELECT MIN(population) AS min_pop,
       MAX(population) AS max_pop,
       MIN(population_growth) AS min_pop_growth,
       MAX(population_growth) AS max_pop_growth 
  FROM facts
 WHERE name != 'World';

Done.

[(0, 1367485388, 0.0, 4.02)]

### Exploring Average Population and Area
Let's now explore population density. Population density depends on the population and the country's area. Let's look at the average values for these two columns.

In [16]:
%%sql
SELECT AVG(population) AS avg_population, AVG(area) AS avg_area
  FROM facts
 WHERE name != 'World'; --# We need this exclusion for a proper aggregation.

Done.

[(32242666.56846473, 555093.546184739)]

### Finding Densely Populated Countries:

To finish, we'll build on the query we wrote for the previous screen to find countries that are densely populated.  We'll identify countries that have the following:

* Above-average values for population.
* Below-average values for area.

It's possible to write this query by copying the values we calculated on the previous screen, but also to do this without hard-coding them!
    
Next we'll: write a query that finds all countries meeting both of the following criteria:
* The `population` that is above average.
* The `area` that is below average.

In [22]:
%%sql
SELECT name, population, area, ROUND(CAST(population AS float)/CAST(area AS float), 2) AS pop_area_ratio
  FROM facts
 WHERE population > (SELECT AVG(population)
                       FROM facts
                      WHERE name != 'World'
                    )
   AND area < (SELECT AVG(area)
                 FROM facts
                WHERE name != 'World'
);

Done.

[('Bangladesh', 168957745, 148460, 1138.07),
 ('Germany', 80854408, 357022, 226.47),
 ('Iraq', 37056169, 438317, 84.54),
 ('Italy', 61855120, 301340, 205.27),
 ('Japan', 126919659, 377915, 335.84),
 ('Korea, South', 49115196, 99720, 492.53),
 ('Morocco', 33322699, 446550, 74.62),
 ('Philippines', 100998376, 300000, 336.66),
 ('Poland', 38562189, 312685, 123.33),
 ('Spain', 48146134, 505370, 95.27),
 ('Thailand', 67976405, 513120, 132.48),
 ('Uganda', 37101745, 241038, 153.92),
 ('United Kingdom', 64088222, 243610, 263.08),
 ('Vietnam', 94348835, 331210, 284.86)]

Let's calculate the population to area ratio.

In [24]:
%%sql
SELECT name, population, area, ROUND(CAST(population AS float)/CAST(area AS float), 2) AS pop_area_ratio
  FROM facts
 WHERE name <> 'World'
ORDER BY pop_area_ratio DESC
LIMIT 12;

Done.

[('Macau', 592731, 28, 21168.96),
 ('Monaco', 30535, 2, 15267.5),
 ('Singapore', 5674472, 697, 8141.28),
 ('Hong Kong', 7141106, 1108, 6445.04),
 ('Gaza Strip', 1869055, 360, 5191.82),
 ('Gibraltar', 29258, 6, 4876.33),
 ('Bahrain', 1346613, 760, 1771.86),
 ('Maldives', 393253, 298, 1319.64),
 ('Malta', 413965, 316, 1310.02),
 ('Bermuda', 70196, 54, 1299.93),
 ('Sint Maarten', 39689, 34, 1167.32),
 ('Bangladesh', 168957745, 148460, 1138.07)]

Macau is the most densely populated nation.

On comparing the above 2 cells, we would expect atleast 80-90% of the countries to match in both the queries. The reason that this did not happen is due to the comparitively low value of area which resulted in a higher population to area ratio in the second query. This means that there are much smaller countries, by area, that are supporting more people within their borders. 

Nevertheless, we can conclude that the countries in the first query have high populations, but relative to their much smaller counterparts, aren't nearly as densely populated. With the exception of Bangladesh. While it's population to area ratio isn't in the top 10. Given that it's in the top 12. It is impressive that Bangladesh can support such a population given it's area.
### Population Growth

In [19]:
%%sql
SELECT  name, population AS current_pop, population_growth, 
        ROUND(population*population_growth, 2) AS estimated_pop_next_year 
  FROM facts
 WHERE name <> 'World'
ORDER BY estimated_pop_next_year DESC
LIMIT 10;

Done.

[('India', 1251695584, 1.22, 1527068612.48),
 ('China', 1367485388, 0.45, 615368424.6),
 ('Nigeria', 181562056, 2.45, 444827037.2),
 ('Pakistan', 199085847, 1.46, 290665336.62),
 ('Ethiopia', 99465819, 2.89, 287456216.91),
 ('Bangladesh', 168957745, 1.6, 270332392.0),
 ('United States', 321368864, 0.78, 250667713.92),
 ('Indonesia', 255993674, 0.92, 235514180.08),
 ('Congo, Democratic Republic of the', 79375136, 2.45, 194469083.2),
 ('Philippines', 100998376, 1.61, 162607385.36)]

It is estimated that <b>India's</b> population will grow the most, not by growth rate, but by force of their large population. You can see in the table below that India's growth rate isn't even in the top 10 for growth rate.

In [21]:
%%sql
SELECT  name, population AS current_pop, population_growth
FROM facts
 WHERE name <> 'World'
ORDER BY population_growth DESC
LIMIT 10;

Done.

[('South Sudan', 12042910, 4.02),
 ('Malawi', 17964697, 3.32),
 ('Burundi', 10742276, 3.28),
 ('Niger', 18045729, 3.25),
 ('Uganda', 37101745, 3.24),
 ('Qatar', 2194817, 3.07),
 ('Burkina Faso', 18931686, 3.03),
 ('Mali', 16955536, 2.98),
 ('Cook Islands', 9838, 2.95),
 ('Iraq', 37056169, 2.93)]

### Countries with the Largest Area

In [26]:
%%sql
SELECT name, area, area_water, area_land,
       ROUND(CAST(area_water AS Float)/CAST(area_land AS Float), 2) AS Water_land_ratio
  FROM facts
 WHERE name <> 'World'
ORDER BY area DESC
 LIMIT 10;

Done.

[('Russia', 17098242, 720500, 16377742, 0.04),
 ('Canada', 9984670, 891163, 9093507, 0.1),
 ('United States', 9826675, 664709, 9161966, 0.07),
 ('China', 9596960, 270550, 9326410, 0.03),
 ('Brazil', 8515770, 157630, 8358140, 0.02),
 ('Australia', 7741220, 58920, 7682300, 0.01),
 ('European Union', 4324782, None, None, None),
 ('India', 3287263, 314070, 2973193, 0.11),
 ('Argentina', 2780400, 43710, 2736690, 0.02),
 ('Kazakhstan', 2724900, 25200, 2699700, 0.01)]

We can see that Russia and Canada is #1 and #2, respectively. What is interesting is that while the United States is #3, it has less land area than China. What could explain why the United States has much more water area is that it has two large coast lines in the east and west. Alaska, it's largest state, has an enormous coast line. Also, the United States has many overseas territories in the Pacific that contributes to `area_water`. China just doesn't have those things.

## Conclusion
We started this project wanting to answer the following questions using the factbook:

<p>#1) Which countries are densely populated?</p>
<p>#2) Which countries will add the most people to their populations next year?</p>
<p>#3) Which countries have the largest area? Of those, how much of it land, and how much of it is water?</p>

We accomplished what we set out to do.

<p>#1) Macau is the most densely populated nation. While Bangladesh isn't nearly as dense. It is still within the top 12 of the most densely populated nations while also supporting an enormous population.</p>
<p>#2) India is going to add the most number people, not only because of it's growth rate, but also because of it's large population.</p>
<p>#3) Russia and Canada are the largest countries by `area` and `land_area`. What was interesting is that while the United States is #3 in terms of total `area`. It actually has a smaller `land_area` than China.</p>